app/controllers/appointment_controller.rb

SELECT `appointments`.* FROM `appointments`
---
  def list
    @appointments = Appointment.all

SELECT `appointments`.* FROM `appointments` WHERE `appointments`.`id` = 1 LIMIT 1
---
  def show
    @appointment = Appointment.find(params[:id])

SELECT `salons`.* FROM `salons`
---
  def new
    @appointment = Appointment.new
    @salons = Salon.all

INSERT INTO `appointments` (`persona`, `fecha`, `hora`, `telefono`, `salon_id`) VALUES ('Juan Manuel', '04/06/2021', '14:30', 1231234, 2)
---
  def create
    @appointment = Appointment.create(appointment_params)

SELECT `appointments`.* FROM `appointments` WHERE `appointments`.`id` = 7 LIMIT 1
SELECT `salons`.* FROM `salons`
---
  def edit
    @appointment = Appointment.find(params[:id])
    @salons = Salon.all

SELECT `appointments`.* FROM `appointments` WHERE `appointments`.`id` = 5 LIMIT 1
UPDATE `appointments` SET `appointments`.`salon_id` = 3 WHERE `appointments`.`id` = 5
---
  def update
    @appointment = Appointment.find(params[:id])

    if @appointment.update(appointment_param)

DELETE FROM `appointments` WHERE `appointments`.`id` = 8
SELECT `appointments`.* FROM `appointments` WHERE `appointments`.`id` = 8 LIMIT 1
---
  def delete
    Appointment.find(params[:id]).destroy