app/controllers/salon_controller.rb

SELECT `salons`.* FROM `salons`
---
  def list
    @salons = Salon.all

SELECT `salons`.* FROM `salons` WHERE `salons`.`id` = 1 LIMIT 1
---
  def show
    @salon = Salon.find(params[:id])

INSERT INTO `salons` (`horario`, `localizacion`, `nombre`) VALUES ('09:30-21:30', 'Granada', 'BarberShop')
---
  def create
    @salon = Salon.new(salon_params)

    if @salon.save

SELECT `salons`.* FROM `salons` WHERE `salons`.`id` = 1 LIMIT 1
---
  def edit
    @salon = Salon.find(params[:id])

SELECT `salons`.* FROM `salons` WHERE `salons`.`id` = 1 LIMIT 1
UPDATE `salons` SET `salons`.`nombre` = 'BarberSho' WHERE `salons`.`id` = 1
---
  def update
    @salon = Salon.find(params[:id])

    if @salon.update(salon_param)

DELETE FROM `salons` WHERE `salons`.`id` = 1
SELECT `salons`.* FROM `salons` WHERE `salons`.`id` = 1 LIMIT 1
---
  def delete
    Salon.find(params[:id]).destroy